import tojscript

оғоз(){
    экран(500, 500, "TojScript Графика")

    # Осмон (фон)
    ранг(0, 0, 500, "/кабуд/", 350)

    # Замин
    ранг(0, 350, 500, "/сабз/", 150)

    # Хона
    ранг(150, 260, 200, "/зард/", 140)

    # Бом
    хат(140, 260, 250, 150, "/сурх/", 4)
    хат(360, 260, 250, 150, "/сурх/", 4)

    # Дар
    ранг(220, 320, 60, "/норинҷӣ/", 80)

    # Тиреза
    ранг(165, 280, 50, "/сафед/", 50)
    ранг(285, 280, 50, "/сафед/", 50)

    # Офтоб
    доира(420, 80, 50, "/зард/")

    # Матн
    матн(250, 470, "Хонаи ман!", "/сафед/", 20)

    нишон()
}